import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css']
})
export class AppComponent {
  title = 'dor';

  headers=["Вид","Наименование", "Ед.изм.", "Цена:р/шт с НДС","СКЛАД"];
  rows=[{
    "Вид": "ТЭНы для нагрева воды (ст.12х18н10т) нерж.",
    "Наименование" : "ТЭН 140 A 13 / 5,0 J 220 Ф7 R 23,5 штуцера (12-01)" ,
    "Ед.изм." :"шт.",
    "Цена:р/шт с НДС" : "910,00",
    "СКЛАД" : "0,00",
    },
    {"Вид" :"ТЭНы для нагрева воды (ст.12х18н10т) нерж." ,
    "Наименование" :"ТЭН 140 А 13 / 5,0 J 220 Ф7 R 23,5 штуцера (габарит 460 мм)",
    "Eд.изм." :  "шт.",
    "Цена:p/шт с НДС" : "850,00",
    "СКЛАД" : "12,00"
    },
    {
    "Вид" :"ТЭНы для нагрева воды (ст.12х18н10т) нерж." ,
    "Наименование" :"ТЭН 100 А 13 / 5,0 J 220 Ф2 R 30 штуцера",
    "Ед.изм" :  "шт.",
    "Цена:р/шт с НДС" : "470,00",
    "СКЛАД" : "5,00"
    }
  ]
}
